Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    
    // Регистр сведений "УчетПосещений"
    Запись = РегистрыСведений.УчетПосещений.СоздатьЗапись();
    Запись.Студент = Студент;
    Запись.ДатаПосещения = Дата;
    Запись.ВремяУхода = ВремяУхода;
    Запись.Причина = Жалобы;
    Запись.ПринятыеМеры = ПринятыеМеры;
    Запись.Записать();
    
    // Регистр накопления "АгрегатПосещаемости"
    Движение = Движения.АгрегатПосещаемости.Добавить();
    Движение.Период = Дата;
    Движение.Студент = Студент;
    Движение.КоличествоПосещений = 1;
    
КонецПроцедуры