Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    
    Движения.ИсторияПоказателейЗдоровья.Записывать = Истина;
    Движение = Движения.ИсторияПоказателейЗдоровья.Добавить();
    Движение.Период = Дата;
    Движение.Студент = Студент;
    Движение.Показатель = ПоказателиЗдоровья.НайтиПоНаименованию("Рост");
    Движение.Значение = Рост;
    
    Движение = Движения.ИсторияПоказателейЗдоровья.Добавить();
    Движение.Период = Дата;
    Движение.Студент = Студент;
    Движение.Показатель = ПоказателиЗдоровья.НайтиПоНаименованию("Вес");
    Движение.Значение = Вес;
    
КонецПроцедуры